read_verilog verilog/adder.v verilog/cpu_v2.v verilog/mux2to1.v verilog/alu_control.v verilog/pipeline_registers.v verilog/alu_v2.v verilog/program_counter.v verilog/branch_decide.v verilog/forwarding_unit.v verilog/branch_predictor.v verilog/imm_gen.v verilog/control_unit.v verilog/cache.v verilog/memory.v verilog/register_file.v verilog/CSR.v verilog/dataMem_mask_gen.v verilog/mux4_1.v verilog/DSPadder.v verilog/DSPsubtractor.v toplevel_v2.v

synth_ice40 -noflatten -blif sail_v2.blif

write_json sail_v2.json
