read_verilog verilog/DSPadder.v verilog/DSPsubtractor.v verilog/DSPcpu.v verilog/mux2to1.v verilog/alu_control.v verilog/pipeline_registers.v verilog/DSPalu.v verilog/program_counter.v verilog/branch_decide.v verilog/forwarding_unit.v verilog/branch_predictor.v verilog/imm_gen.v verilog/control_unit.v verilog/instruction_mem_bram.v verilog/data_mem.v verilog/register_file.v verilog/CSR.v verilog/dataMem_mask_gen.v toplevel_bram.v

synth_ice40 -noflatten -blif sail_bram_DSP.blif

write_json sail_bram_DSP.json
